#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.prod_db.random_password.osem_db_master_pass: Refreshing state... [id=none]
aws_ses_domain_identity.seagl: Refreshing state... [id=seagl.org]
data.aws_vpc.vpc: Reading...
aws_route53_record.mailu-test-a: Refreshing state... [id=Z0173878287JIU5M4KB8R_mail.mail-test.seagl.org_A]
aws_s3_bucket.state: Refreshing state... [id=seagl-terraform]
module.prod_db.aws_secretsmanager_secret.osem-db-pass: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:663166083306:secret:db-pass-osem-5KW1mS]
aws_instance.dokku: Refreshing state... [id=i-02ee81d4bd0860d30]
module.prod_db.aws_db_subnet_group.osem: Refreshing state... [id=osem]
aws_route53_record.route_53_dmarc_txt: Refreshing state... [id=Z0173878287JIU5M4KB8R__dmarc.seagl.org_TXT]
aws_route53_record.cloud-aaaa: Refreshing state... [id=Z0173878287JIU5M4KB8R_cloud.seagl.org_AAAA]
aws_route53_record.cloud-a: Refreshing state... [id=Z0173878287JIU5M4KB8R_cloud.seagl.org_A]
aws_route53_record.alias: Refreshing state... [id=Z0173878287JIU5M4KB8R_alias.seagl.org_CNAME]
aws_ses_email_identity.email: Refreshing state... [id=sre@seagl.org]
aws_route53_record.route_53_root_txt: Refreshing state... [id=Z0173878287JIU5M4KB8R__TXT]
aws_ses_domain_identity.email_domain_identity: Refreshing state... [id=seagl.org]
module.prod_db.aws_secretsmanager_secret_version.osem-db-pass-val: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:663166083306:secret:db-pass-osem-5KW1mS|5E8ED816-E9AA-4E8E-A382-2EEE9FC74A66]
aws_ses_domain_dkim.email_dkim: Refreshing state... [id=seagl.org]
aws_route53_record.email_dkim_records[1]: Refreshing state... [id=Z0173878287JIU5M4KB8R_zjerfwsrr5wpwp5p5klnsrrzp6ralpcp._domainkey.seagl.org_CNAME]
aws_route53_record.email_dkim_records[0]: Refreshing state... [id=Z0173878287JIU5M4KB8R_nldzqxeyq5fyslu3tzvj4ltbwbexupuj._domainkey.seagl.org_CNAME]
aws_route53_record.email_dkim_records[2]: Refreshing state... [id=Z0173878287JIU5M4KB8R_o7o3tsrrlwgkmmx3a7f5njkrvi75woso._domainkey.seagl.org_CNAME]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-231ecb46]
module.prod_db.aws_security_group.osem_rds_security_group: Refreshing state... [id=sg-006c493d98f3c7f1a]
module.prod_db.aws_security_group_rule.private_in: Refreshing state... [id=sgrule-3182957500]
module.prod_db.aws_security_group_rule.private_out: Refreshing state... [id=sgrule-1612436969]
module.prod_db.aws_db_instance.osem: Refreshing state... [id=osem]
aws_s3_bucket_public_access_block.state: Refreshing state... [id=seagl-terraform]
aws_s3_bucket_versioning.state: Refreshing state... [id=seagl-terraform]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.mailu-test-autoconfig-cname will be created
  + resource "aws_route53_record" "mailu-test-autoconfig-cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "autoconfig.mail-test.seagl.org"
      + records         = [
          + "mail.mail-test.seagl.org.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # aws_route53_record.mailu-test-autoconfig-srv["_autodiscover._tcp"] will be created
  + resource "aws_route53_record" "mailu-test-autoconfig-srv" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_autodiscover._tcp.mail-test.seagl.org"
      + records         = [
          + "10 1 443 mail.mail-test.seagl.org.",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # aws_route53_record.mailu-test-autoconfig-srv["_imap._tcp"] will be created
  + resource "aws_route53_record" "mailu-test-autoconfig-srv" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_imap._tcp.mail-test.seagl.org"
      + records         = [
          + "20 1 143 mail.mail-test.seagl.org.",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # aws_route53_record.mailu-test-autoconfig-srv["_imaps._tcp"] will be created
  + resource "aws_route53_record" "mailu-test-autoconfig-srv" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_imaps._tcp.mail-test.seagl.org"
      + records         = [
          + "10 1 993 mail.mail-test.seagl.org.",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # aws_route53_record.mailu-test-autoconfig-srv["_pop3._tcp"] will be created
  + resource "aws_route53_record" "mailu-test-autoconfig-srv" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_pop3._tcp.mail-test.seagl.org"
      + records         = [
          + "20 1 110 mail.mail-test.seagl.org.",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # aws_route53_record.mailu-test-autoconfig-srv["_pop3s._tcp"] will be created
  + resource "aws_route53_record" "mailu-test-autoconfig-srv" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_pop3s._tcp.mail-test.seagl.org"
      + records         = [
          + "10 1 995 mail.mail-test.seagl.org.",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # aws_route53_record.mailu-test-autoconfig-srv["_submission._tcp"] will be created
  + resource "aws_route53_record" "mailu-test-autoconfig-srv" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_submission._tcp.mail-test.seagl.org"
      + records         = [
          + "20 1 587 mail.mail-test.seagl.org.",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # aws_route53_record.mailu-test-autoconfig-srv["_submissions._tcp"] will be created
  + resource "aws_route53_record" "mailu-test-autoconfig-srv" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_submissions._tcp.mail-test.seagl.org"
      + records         = [
          + "10 1 465 mail.mail-test.seagl.org.",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # aws_route53_record.mailu-test-dkim will be created
  + resource "aws_route53_record" "mailu-test-dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dkim._domainkey.mail-test.seagl.org"
      + records         = [
          + "X2VK0itMcPCBqIUvyOSIHJ8c7i8VPmcV+G6VDquepNsmFN0zcvNXAosqaWOHCnzCGzvQiwm6Lbq4vMxUsU6BLUv1JiPq3zXtqQ4tp6VynpLIy5VaF4XI5fyibsKTPuzI0d58tuiCrgCCMy5T9BmkCnQAzQIDAQAB",
          + "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA1Jw/diiAFRmarcHsr/KkGvfr22CVA5xTJTWRInvKi2My7PbWjhLSGNx7XcJw1DCcfOGb1cdArjNmYDmmG6VRRTQjCr2RWBSihIRLodnc+KPeS2Xnipi0JdNg7CTCNVQfA+znlKoWqalTT0nKrlDf87vhLmltU4wOYnrmvtZvtHkdwd9GA7hxMdHu4LnW",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # aws_route53_record.mailu-test-dmarc will be created
  + resource "aws_route53_record" "mailu-test-dmarc" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc.mail-test.seagl.org"
      + records         = [
          + "v=DMARC1; p=reject; rua=mailto:dmarc@mail-test.seagl.org; ruf=mailto:dmarc@mail-test.seagl.org; adkim=s; aspf=s",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # aws_route53_record.mailu-test-mx will be created
  + resource "aws_route53_record" "mailu-test-mx" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail-test.seagl.org"
      + records         = [
          + "10 mail.mail-test.seagl.org.",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # aws_route53_record.mailu-test-spf will be created
  + resource "aws_route53_record" "mailu-test-spf" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail-test.seagl.org"
      + records         = [
          + "v=spf1 mx ~all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.state,
  on s3.tf line 1, in resource "aws_s3_bucket" "state":
   1: resource "aws_s3_bucket" "state" {

Use the aws_s3_bucket_versioning resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @strugee, Action: `pull_request`*